Terraform Plan:

```
Acquiring state lock. This may take a few moments...
module.data_ingester.random_string.resource_code: Refreshing state... [id=p3sha]
module.data_ingester.data.azurerm_client_config.current: Reading...
module.data_ingester.azurerm_resource_group.tfstate: Refreshing state... [id=/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics]
module.data_ingester.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iN2VjMGExZC1hZjAyLTQ2YzUtOTdkMS05MDBkNGUzMmNmOTM7b2JqZWN0SWQ9YjdlY2YxYWUtYzE0Zi00YmU4LWE4ZDEtZGI3YjUxNTdkNWQ5O3N1YnNjcmlwdGlvbklkPTMyNTkxZjIyLTgyMDktNGM4Mi1hNjVjLTYxOGI5NjdlN2JmZjt0ZW5hbnRJZD05YzdkOWRkMy04NDBjLTRiM2YtODE4ZS01NTI4NjUwODJlMTY=]
module.data_ingester.azurerm_service_plan.SSPHP_rust: Refreshing state... [id=/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics/providers/Microsoft.Web/serverFarms/SSPHP-Metrics_rust-p3sha]
module.data_ingester.azurerm_application_insights.SSPHP: Refreshing state... [id=/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics/providers/Microsoft.Insights/components/SSPHP-Metrics]
module.data_ingester.azurerm_storage_account.tfstate: Refreshing state... [id=/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics/providers/Microsoft.Storage/storageAccounts/tfstatep3sha]
module.data_ingester.azurerm_storage_container.tfstate: Refreshing state... [id=https://tfstatep3sha.blob.core.windows.net/tfstate]
module.data_ingester.azurerm_linux_function_app.SSPHP_rust-vnet[0]: Refreshing state... [id=/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics/providers/Microsoft.Web/sites/SSPHP-Metrics-rust-vnet-p3sha]
module.data_ingester.azurerm_linux_function_app.SSPHP_rust: Refreshing state... [id=/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics/providers/Microsoft.Web/sites/SSPHP-Metrics-rust-p3sha]
module.data_ingester.azurerm_app_service_virtual_network_swift_connection.sspph_rust_vnet[0]: Refreshing state... [id=/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics/providers/Microsoft.Web/sites/SSPHP-Metrics-rust-vnet-p3sha/config/virtualNetwork]
module.data_ingester.azurerm_key_vault.SSPHP: Refreshing state... [id=/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics/providers/Microsoft.KeyVault/vaults/SSPHP-Metrics]
module.data_ingester.azurerm_key_vault_certificate.example: Refreshing state... [id=https://ssphp-metrics.vault.azure.net/certificates/ad-client-certificate/f824d238855648b581f1a3840c3e7286]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.data_ingester.data.archive_file.data_ingester_rust will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "data_ingester_rust" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = (known after apply)
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "../data_ingester/../../data_ingester_workspace/data_ingester_axum_entrypoint/function_zip/"
      + type                = "zip"
    }

  # module.data_ingester.azurerm_app_service_virtual_network_swift_connection.sspph_rust_vnet[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "azurerm_app_service_virtual_network_swift_connection" "sspph_rust_vnet" {
      - app_service_id = "/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics/providers/Microsoft.Web/sites/SSPHP-Metrics-rust-vnet-p3sha" -> null
      - id             = "/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics/providers/Microsoft.Web/sites/SSPHP-Metrics-rust-vnet-p3sha/config/virtualNetwork" -> null
      - subnet_id      = "/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d01-core/providers/Microsoft.Network/virtualNetworks/s194d01-core-vn-01/subnets/s194d01-core-sn-01" -> null
    }

  # module.data_ingester.azurerm_key_vault.SSPHP will be updated in-place
  ~ resource "azurerm_key_vault" "SSPHP" {
      ~ access_policy                   = [
            # (5 unchanged elements hidden)
            {
                application_id          = null
                certificate_permissions = [
                    "Get",
                    "List",
                ]
                key_permissions         = [
                    "Get",
                    "List",
                ]
                object_id               = "7c1e31a1-6cb2-4b38-82b0-ef25947b9f95"
                secret_permissions      = [
                    "Get",
                    "List",
                ]
                storage_permissions     = [
                    "Get",
                    "List",
                ]
                tenant_id               = "9c7d9dd3-840c-4b3f-818e-552865082e16"
            },
          - {
              - certificate_permissions = [
                  - "Get",
                  - "List",
                ]
              - key_permissions         = [
                  - "Get",
                  - "List",
                ]
              - object_id               = "3932dc30-118f-47bc-b136-5388d6356c96"
              - secret_permissions      = [
                  - "Get",
                  - "List",
                ]
              - storage_permissions     = [
                  - "Get",
                  - "List",
                ]
              - tenant_id               = "9c7d9dd3-840c-4b3f-818e-552865082e16"
                # (1 unchanged attribute hidden)
            },
        ]
        id                              = "/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics/providers/Microsoft.KeyVault/vaults/SSPHP-Metrics"
        name                            = "SSPHP-Metrics"
        tags                            = {
            "Environment"      = "Dev"
            "Product"          = "Protective Monitoring - Splunk SaaS"
            "Service Offering" = "Protective Monitoring - Splunk SaaS"
        }
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.data_ingester.azurerm_linux_function_app.SSPHP_rust will be updated in-place
  ~ resource "azurerm_linux_function_app" "SSPHP_rust" {
      ~ app_settings                                   = {
          + "APPINSIGHTS_INSTRUMENTATIONKEY" = (sensitive value)
            # (4 unchanged elements hidden)
        }
        id                                             = "/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics/providers/Microsoft.Web/sites/SSPHP-Metrics-rust-p3sha"
        name                                           = "SSPHP-Metrics-rust-p3sha"
      ~ tags                                           = {
            "Environment"                                    = "Dev"
            "Product"                                        = "Protective Monitoring - Splunk SaaS"
            "Service Offering"                               = "Protective Monitoring - Splunk SaaS"
          - "hidden-link: /app-insights-conn-string"         = "InstrumentationKey=fa7ff01b-8fda-41c2-ac15-c616a7d6e4d4;IngestionEndpoint=https://westeurope-2.in.applicationinsights.azure.com/;LiveEndpoint=https://westeurope.livediagnostics.monitor.azure.com/;ApplicationId=042c0014-747c-4927-be3b-74cbf748f850" -> null
          - "hidden-link: /app-insights-instrumentation-key" = "fa7ff01b-8fda-41c2-ac15-c616a7d6e4d4" -> null
          - "hidden-link: /app-insights-resource-id"         = "/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics/providers/microsoft.insights/components/SSPHP-Metrics" -> null
        }
      ~ zip_deploy_file                                = "../data_ingester/data_ingester_rust_20241004020251.zip" -> (known after apply)
        # (31 unchanged attributes hidden)

      ~ site_config {
          - application_insights_key                      = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (2 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.data_ingester.azurerm_linux_function_app.SSPHP_rust-vnet[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "azurerm_linux_function_app" "SSPHP_rust-vnet" {
      - app_settings                                   = {
          - "KEY_VAULT_NAME"           = "SSPHP-Metrics"
          - "RUST_BACKTRACE"           = "1"
          - "RUST_LOG"                 = "info"
          - "WEBSITE_RUN_FROM_PACKAGE" = "1"
        } -> null
      - builtin_logging_enabled                        = true -> null
      - client_certificate_enabled                     = false -> null
      - client_certificate_mode                        = "Optional" -> null
      - content_share_force_disabled                   = false -> null
      - custom_domain_verification_id                  = (sensitive value) -> null
      - daily_memory_time_quota                        = 0 -> null
      - default_hostname                               = "ssphp-metrics-rust-vnet-p3sha.azurewebsites.net" -> null
      - enabled                                        = true -> null
      - ftp_publish_basic_authentication_enabled       = true -> null
      - functions_extension_version                    = "~4" -> null
      - https_only                                     = false -> null
      - id                                             = "/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics/providers/Microsoft.Web/sites/SSPHP-Metrics-rust-vnet-p3sha" -> null
      - key_vault_reference_identity_id                = "SystemAssigned" -> null
      - kind                                           = "functionapp,linux" -> null
      - location                                       = "westeurope" -> null
      - name                                           = "SSPHP-Metrics-rust-vnet-p3sha" -> null
      - outbound_ip_address_list                       = [
          - "51.136.120.180",
          - "51.105.113.180",
          - "51.136.120.184",
          - "51.136.120.188",
          - "51.136.120.252",
          - "51.136.121.1",
          - "20.105.224.42",
        ] -> null
      - outbound_ip_addresses                          = "51.136.120.180,51.105.113.180,51.136.120.184,51.136.120.188,51.136.120.252,51.136.121.1,20.105.224.42" -> null
      - possible_outbound_ip_address_list              = [
          - "51.136.123.140",
          - "51.136.123.149",
          - "51.136.123.169",
          - "51.136.123.186",
          - "51.136.123.189",
          - "51.136.124.11",
          - "51.105.116.162",
          - "51.105.118.111",
          - "51.105.118.121",
          - "51.105.119.141",
          - "51.105.119.225",
          - "51.136.120.126",
          - "51.136.120.180",
          - "51.105.113.180",
          - "51.136.120.184",
          - "51.136.120.188",
          - "51.136.120.252",
          - "51.136.121.1",
          - "51.105.114.199",
          - "51.136.122.176",
          - "51.136.123.38",
          - "51.136.123.70",
          - "51.136.123.93",
          - "51.136.123.108",
          - "51.136.123.140",
          - "51.136.123.149",
          - "51.136.123.169",
          - "51.136.123.186",
          - "51.136.123.189",
          - "51.136.124.11",
          - "51.136.124.15",
          - "51.136.124.30",
          - "51.136.124.35",
          - "51.136.124.50",
          - "51.136.124.98",
          - "51.136.124.121",
          - "20.105.224.42",
        ] -> null
      - possible_outbound_ip_addresses                 = "51.136.123.140,51.136.123.149,51.136.123.169,51.136.123.186,51.136.123.189,51.136.124.11,51.105.116.162,51.105.118.111,51.105.118.121,51.105.119.141,51.105.119.225,51.136.120.126,51.136.120.180,51.105.113.180,51.136.120.184,51.136.120.188,51.136.120.252,51.136.121.1,51.105.114.199,51.136.122.176,51.136.123.38,51.136.123.70,51.136.123.93,51.136.123.108,51.136.123.140,51.136.123.149,51.136.123.169,51.136.123.186,51.136.123.189,51.136.124.11,51.136.124.15,51.136.124.30,51.136.124.35,51.136.124.50,51.136.124.98,51.136.124.121,20.105.224.42" -> null
      - public_network_access_enabled                  = true -> null
      - resource_group_name                            = "s194d00-SSPHP-Metrics" -> null
      - service_plan_id                                = "/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics/providers/Microsoft.Web/serverFarms/SSPHP-Metrics_rust-p3sha" -> null
      - site_credential                                = (sensitive value) -> null
      - storage_account_access_key                     = (sensitive value) -> null
      - storage_account_name                           = "tfstatep3sha" -> null
      - storage_uses_managed_identity                  = false -> null
      - tags                                           = {
          - "Environment"      = "Dev"
          - "Product"          = "Protective Monitoring - Splunk SaaS"
          - "Service Offering" = "Protective Monitoring - Splunk SaaS"
        } -> null
      - virtual_network_subnet_id                      = "/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d01-core/providers/Microsoft.Network/virtualNetworks/s194d01-core-vn-01/subnets/s194d01-core-sn-01" -> null
      - vnet_image_pull_enabled                        = false -> null
      - webdeploy_publish_basic_authentication_enabled = true -> null
      - zip_deploy_file                                = "../data_ingester/data_ingester_rust_20241004020251.zip" -> null
        # (3 unchanged attributes hidden)

      - identity {
          - identity_ids = [] -> null
          - principal_id = "3932dc30-118f-47bc-b136-5388d6356c96" -> null
          - tenant_id    = "9c7d9dd3-840c-4b3f-818e-552865082e16" -> null
          - type         = "SystemAssigned" -> null
        }

      - site_config {
          - always_on                                     = false -> null
          - app_scale_limit                               = 0 -> null
          - application_insights_key                      = (sensitive value) -> null
          - container_registry_use_managed_identity       = false -> null
          - default_documents                             = [
              - "Default.htm",
              - "Default.html",
              - "Default.asp",
              - "index.htm",
              - "index.html",
              - "iisstart.htm",
              - "default.aspx",
              - "index.php",
            ] -> null
          - detailed_error_logging_enabled                = false -> null
          - elastic_instance_minimum                      = 1 -> null
          - ftps_state                                    = "Disabled" -> null
          - health_check_eviction_time_in_min             = 0 -> null
          - http2_enabled                                 = false -> null
          - ip_restriction_default_action                 = "Allow" -> null
          - load_balancing_mode                           = "LeastRequests" -> null
          - managed_pipeline_mode                         = "Integrated" -> null
          - minimum_tls_version                           = "1.2" -> null
          - pre_warmed_instance_count                     = 1 -> null
          - remote_debugging_enabled                      = false -> null
          - runtime_scale_monitoring_enabled              = false -> null
          - scm_ip_restriction_default_action             = "Allow" -> null
          - scm_minimum_tls_version                       = "1.2" -> null
          - scm_type                                      = "None" -> null
          - scm_use_main_ip_restriction                   = false -> null
          - use_32_bit_worker                             = false -> null
          - vnet_route_all_enabled                        = false -> null
          - websockets_enabled                            = false -> null
          - worker_count                                  = 1 -> null
            # (8 unchanged attributes hidden)

          - application_stack {
              - use_custom_runtime          = true -> null
              - use_dotnet_isolated_runtime = false -> null
                # (5 unchanged attributes hidden)
            }

          - cors {
              - allowed_origins     = [
                  - "https://portal.azure.com",
                ] -> null
              - support_credentials = true -> null
            }
        }
    }

Plan: 0 to add, 2 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
Releasing state lock. This may take a few moments...
stdout<<ghadelimiter_b412244b-fb49-4b8c-b370-2ca7c1b33c04
Acquiring state lock. This may take a few moments...
module.data_ingester.random_string.resource_code: Refreshing state... [id=p3sha]
module.data_ingester.data.azurerm_client_config.current: Reading...
module.data_ingester.azurerm_resource_group.tfstate: Refreshing state... [id=/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics]
module.data_ingester.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iN2VjMGExZC1hZjAyLTQ2YzUtOTdkMS05MDBkNGUzMmNmOTM7b2JqZWN0SWQ9YjdlY2YxYWUtYzE0Zi00YmU4LWE4ZDEtZGI3YjUxNTdkNWQ5O3N1YnNjcmlwdGlvbklkPTMyNTkxZjIyLTgyMDktNGM4Mi1hNjVjLTYxOGI5NjdlN2JmZjt0ZW5hbnRJZD05YzdkOWRkMy04NDBjLTRiM2YtODE4ZS01NTI4NjUwODJlMTY=]
module.data_ingester.azurerm_service_plan.SSPHP_rust: Refreshing state... [id=/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics/providers/Microsoft.Web/serverFarms/SSPHP-Metrics_rust-p3sha]
module.data_ingester.azurerm_application_insights.SSPHP: Refreshing state... [id=/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics/providers/Microsoft.Insights/components/SSPHP-Metrics]
module.data_ingester.azurerm_storage_account.tfstate: Refreshing state... [id=/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics/providers/Microsoft.Storage/storageAccounts/tfstatep3sha]
module.data_ingester.azurerm_storage_container.tfstate: Refreshing state... [id=https://tfstatep3sha.blob.core.windows.net/tfstate]
module.data_ingester.azurerm_linux_function_app.SSPHP_rust-vnet[0]: Refreshing state... [id=/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics/providers/Microsoft.Web/sites/SSPHP-Metrics-rust-vnet-p3sha]
module.data_ingester.azurerm_linux_function_app.SSPHP_rust: Refreshing state... [id=/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics/providers/Microsoft.Web/sites/SSPHP-Metrics-rust-p3sha]
module.data_ingester.azurerm_app_service_virtual_network_swift_connection.sspph_rust_vnet[0]: Refreshing state... [id=/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics/providers/Microsoft.Web/sites/SSPHP-Metrics-rust-vnet-p3sha/config/virtualNetwork]
module.data_ingester.azurerm_key_vault.SSPHP: Refreshing state... [id=/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics/providers/Microsoft.KeyVault/vaults/SSPHP-Metrics]
module.data_ingester.azurerm_key_vault_certificate.example: Refreshing state... [id=https://ssphp-metrics.vault.azure.net/certificates/ad-client-certificate/f824d238855648b581f1a3840c3e7286]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.data_ingester.data.archive_file.data_ingester_rust will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "data_ingester_rust" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = (known after apply)
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "../data_ingester/../../data_ingester_workspace/data_ingester_axum_entrypoint/function_zip/"
      + type                = "zip"
    }

  # module.data_ingester.azurerm_app_service_virtual_network_swift_connection.sspph_rust_vnet[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "azurerm_app_service_virtual_network_swift_connection" "sspph_rust_vnet" {
      - app_service_id = "/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics/providers/Microsoft.Web/sites/SSPHP-Metrics-rust-vnet-p3sha" -> null
      - id             = "/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics/providers/Microsoft.Web/sites/SSPHP-Metrics-rust-vnet-p3sha/config/virtualNetwork" -> null
      - subnet_id      = "/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d01-core/providers/Microsoft.Network/virtualNetworks/s194d01-core-vn-01/subnets/s194d01-core-sn-01" -> null
    }

  # module.data_ingester.azurerm_key_vault.SSPHP will be updated in-place
  ~ resource "azurerm_key_vault" "SSPHP" {
      ~ access_policy                   = [
            # (5 unchanged elements hidden)
            {
                application_id          = null
                certificate_permissions = [
                    "Get",
                    "List",
                ]
                key_permissions         = [
                    "Get",
                    "List",
                ]
                object_id               = "7c1e31a1-6cb2-4b38-82b0-ef25947b9f95"
                secret_permissions      = [
                    "Get",
                    "List",
                ]
                storage_permissions     = [
                    "Get",
                    "List",
                ]
                tenant_id               = "9c7d9dd3-840c-4b3f-818e-552865082e16"
            },
          - {
              - certificate_permissions = [
                  - "Get",
                  - "List",
                ]
              - key_permissions         = [
                  - "Get",
                  - "List",
                ]
              - object_id               = "3932dc30-118f-47bc-b136-5388d6356c96"
              - secret_permissions      = [
                  - "Get",
                  - "List",
                ]
              - storage_permissions     = [
                  - "Get",
                  - "List",
                ]
              - tenant_id               = "9c7d9dd3-840c-4b3f-818e-552865082e16"
                # (1 unchanged attribute hidden)
            },
        ]
        id                              = "/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics/providers/Microsoft.KeyVault/vaults/SSPHP-Metrics"
        name                            = "SSPHP-Metrics"
        tags                            = {
            "Environment"      = "Dev"
            "Product"          = "Protective Monitoring - Splunk SaaS"
            "Service Offering" = "Protective Monitoring - Splunk SaaS"
        }
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.data_ingester.azurerm_linux_function_app.SSPHP_rust will be updated in-place
  ~ resource "azurerm_linux_function_app" "SSPHP_rust" {
      ~ app_settings                                   = {
          + "APPINSIGHTS_INSTRUMENTATIONKEY" = (sensitive value)
            # (4 unchanged elements hidden)
        }
        id                                             = "/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics/providers/Microsoft.Web/sites/SSPHP-Metrics-rust-p3sha"
        name                                           = "SSPHP-Metrics-rust-p3sha"
      ~ tags                                           = {
            "Environment"                                    = "Dev"
            "Product"                                        = "Protective Monitoring - Splunk SaaS"
            "Service Offering"                               = "Protective Monitoring - Splunk SaaS"
          - "hidden-link: /app-insights-conn-string"         = "InstrumentationKey=fa7ff01b-8fda-41c2-ac15-c616a7d6e4d4;IngestionEndpoint=https://westeurope-2.in.applicationinsights.azure.com/;LiveEndpoint=https://westeurope.livediagnostics.monitor.azure.com/;ApplicationId=042c0014-747c-4927-be3b-74cbf748f850" -> null
          - "hidden-link: /app-insights-instrumentation-key" = "fa7ff01b-8fda-41c2-ac15-c616a7d6e4d4" -> null
          - "hidden-link: /app-insights-resource-id"         = "/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics/providers/microsoft.insights/components/SSPHP-Metrics" -> null
        }
      ~ zip_deploy_file                                = "../data_ingester/data_ingester_rust_20241004020251.zip" -> (known after apply)
        # (31 unchanged attributes hidden)

      ~ site_config {
          - application_insights_key                      = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (2 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.data_ingester.azurerm_linux_function_app.SSPHP_rust-vnet[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "azurerm_linux_function_app" "SSPHP_rust-vnet" {
      - app_settings                                   = {
          - "KEY_VAULT_NAME"           = "SSPHP-Metrics"
          - "RUST_BACKTRACE"           = "1"
          - "RUST_LOG"                 = "info"
          - "WEBSITE_RUN_FROM_PACKAGE" = "1"
        } -> null
      - builtin_logging_enabled                        = true -> null
      - client_certificate_enabled                     = false -> null
      - client_certificate_mode                        = "Optional" -> null
      - content_share_force_disabled                   = false -> null
      - custom_domain_verification_id                  = (sensitive value) -> null
      - daily_memory_time_quota                        = 0 -> null
      - default_hostname                               = "ssphp-metrics-rust-vnet-p3sha.azurewebsites.net" -> null
      - enabled                                        = true -> null
      - ftp_publish_basic_authentication_enabled       = true -> null
      - functions_extension_version                    = "~4" -> null
      - https_only                                     = false -> null
      - id                                             = "/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics/providers/Microsoft.Web/sites/SSPHP-Metrics-rust-vnet-p3sha" -> null
      - key_vault_reference_identity_id                = "SystemAssigned" -> null
      - kind                                           = "functionapp,linux" -> null
      - location                                       = "westeurope" -> null
      - name                                           = "SSPHP-Metrics-rust-vnet-p3sha" -> null
      - outbound_ip_address_list                       = [
          - "51.136.120.180",
          - "51.105.113.180",
          - "51.136.120.184",
          - "51.136.120.188",
          - "51.136.120.252",
          - "51.136.121.1",
          - "20.105.224.42",
        ] -> null
      - outbound_ip_addresses                          = "51.136.120.180,51.105.113.180,51.136.120.184,51.136.120.188,51.136.120.252,51.136.121.1,20.105.224.42" -> null
      - possible_outbound_ip_address_list              = [
          - "51.136.123.140",
          - "51.136.123.149",
          - "51.136.123.169",
          - "51.136.123.186",
          - "51.136.123.189",
          - "51.136.124.11",
          - "51.105.116.162",
          - "51.105.118.111",
          - "51.105.118.121",
          - "51.105.119.141",
          - "51.105.119.225",
          - "51.136.120.126",
          - "51.136.120.180",
          - "51.105.113.180",
          - "51.136.120.184",
          - "51.136.120.188",
          - "51.136.120.252",
          - "51.136.121.1",
          - "51.105.114.199",
          - "51.136.122.176",
          - "51.136.123.38",
          - "51.136.123.70",
          - "51.136.123.93",
          - "51.136.123.108",
          - "51.136.123.140",
          - "51.136.123.149",
          - "51.136.123.169",
          - "51.136.123.186",
          - "51.136.123.189",
          - "51.136.124.11",
          - "51.136.124.15",
          - "51.136.124.30",
          - "51.136.124.35",
          - "51.136.124.50",
          - "51.136.124.98",
          - "51.136.124.121",
          - "20.105.224.42",
        ] -> null
      - possible_outbound_ip_addresses                 = "51.136.123.140,51.136.123.149,51.136.123.169,51.136.123.186,51.136.123.189,51.136.124.11,51.105.116.162,51.105.118.111,51.105.118.121,51.105.119.141,51.105.119.225,51.136.120.126,51.136.120.180,51.105.113.180,51.136.120.184,51.136.120.188,51.136.120.252,51.136.121.1,51.105.114.199,51.136.122.176,51.136.123.38,51.136.123.70,51.136.123.93,51.136.123.108,51.136.123.140,51.136.123.149,51.136.123.169,51.136.123.186,51.136.123.189,51.136.124.11,51.136.124.15,51.136.124.30,51.136.124.35,51.136.124.50,51.136.124.98,51.136.124.121,20.105.224.42" -> null
      - public_network_access_enabled                  = true -> null
      - resource_group_name                            = "s194d00-SSPHP-Metrics" -> null
      - service_plan_id                                = "/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d00-SSPHP-Metrics/providers/Microsoft.Web/serverFarms/SSPHP-Metrics_rust-p3sha" -> null
      - site_credential                                = (sensitive value) -> null
      - storage_account_access_key                     = (sensitive value) -> null
      - storage_account_name                           = "tfstatep3sha" -> null
      - storage_uses_managed_identity                  = false -> null
      - tags                                           = {
          - "Environment"      = "Dev"
          - "Product"          = "Protective Monitoring - Splunk SaaS"
          - "Service Offering" = "Protective Monitoring - Splunk SaaS"
        } -> null
      - virtual_network_subnet_id                      = "/subscriptions/32591f22-8209-4c82-a65c-618b967e7bff/resourceGroups/s194d01-core/providers/Microsoft.Network/virtualNetworks/s194d01-core-vn-01/subnets/s194d01-core-sn-01" -> null
      - vnet_image_pull_enabled                        = false -> null
      - webdeploy_publish_basic_authentication_enabled = true -> null
      - zip_deploy_file                                = "../data_ingester/data_ingester_rust_20241004020251.zip" -> null
        # (3 unchanged attributes hidden)

      - identity {
          - identity_ids = [] -> null
          - principal_id = "3932dc30-118f-47bc-b136-5388d6356c96" -> null
          - tenant_id    = "9c7d9dd3-840c-4b3f-818e-552865082e16" -> null
          - type         = "SystemAssigned" -> null
        }

      - site_config {
          - always_on                                     = false -> null
          - app_scale_limit                               = 0 -> null
          - application_insights_key                      = (sensitive value) -> null
          - container_registry_use_managed_identity       = false -> null
          - default_documents                             = [
              - "Default.htm",
              - "Default.html",
              - "Default.asp",
              - "index.htm",
              - "index.html",
              - "iisstart.htm",
              - "default.aspx",
              - "index.php",
            ] -> null
          - detailed_error_logging_enabled                = false -> null
          - elastic_instance_minimum                      = 1 -> null
          - ftps_state                                    = "Disabled" -> null
          - health_check_eviction_time_in_min             = 0 -> null
          - http2_enabled                                 = false -> null
          - ip_restriction_default_action                 = "Allow" -> null
          - load_balancing_mode                           = "LeastRequests" -> null
          - managed_pipeline_mode                         = "Integrated" -> null
          - minimum_tls_version                           = "1.2" -> null
          - pre_warmed_instance_count                     = 1 -> null
          - remote_debugging_enabled                      = false -> null
          - runtime_scale_monitoring_enabled              = false -> null
          - scm_ip_restriction_default_action             = "Allow" -> null
          - scm_minimum_tls_version                       = "1.2" -> null
          - scm_type                                      = "None" -> null
          - scm_use_main_ip_restriction                   = false -> null
          - use_32_bit_worker                             = false -> null
          - vnet_route_all_enabled                        = false -> null
          - websockets_enabled                            = false -> null
          - worker_count                                  = 1 -> null
            # (8 unchanged attributes hidden)

          - application_stack {
              - use_custom_runtime          = true -> null
              - use_dotnet_isolated_runtime = false -> null
                # (5 unchanged attributes hidden)
            }

          - cors {
              - allowed_origins     = [
                  - "https://portal.azure.com",
                ] -> null
              - support_credentials = true -> null
            }
        }
    }

Plan: 0 to add, 2 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
Releasing state lock. This may take a few moments...

ghadelimiter_b412244b-fb49-4b8c-b370-2ca7c1b33c04
stderr<<ghadelimiter_271b3a4b-616f-4716-9000-774b2b353860

ghadelimiter_271b3a4b-616f-4716-9000-774b2b353860
exitcode<<ghadelimiter_3553880d-d9d6-4a14-824e-32c80d2bdad4
0
ghadelimiter_3553880d-d9d6-4a14-824e-32c80d2bdad4
```